thesnowpear/kitchen-agent-based-on-esp32s3/tmp/backup_ai_api_20260520_221138/sdkconfig.defaults
# ESP32-S3-DevKitC-1 N8R8: 8MB Flash + 8MB PSRAM
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="8MB"

# 使用自定义 8MB 分区表：双 OTA、LittleFS、本地 coredump。
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"

# OTA 回滚：升级失败可回退，适合后续远程运维。
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y
CONFIG_APP_ROLLBACK_ENABLE=y

# N8R8 模组常见为 8MB Octal PSRAM；保守使用 80MHz，不启用 120MHz 实验频率。
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_TYPE_ESPPSRAM64=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MEMTEST=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=16384
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=65536
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y

# 现场调试保留 brownout 和 flash coredump，方便定位供电、看门狗和堆栈问题。
CONFIG_ESP_BROWNOUT_DET=y
CONFIG_ESP_BROWNOUT_DET_LVL_SEL_7=y
CONFIG_ESP_COREDUMP_ENABLE_TO_FLASH=y

# 首次硬件点亮默认只运行屏幕 QSPI 安全测试，跳过 Wi-Fi/USB 业务流程。
CONFIG_FRIDGE_SCREEN_TEST=y
CONFIG_FRIDGE_SCREEN_TEST_PCLK_HZ=10000000
